//
//  QuizViewController.swift
//  EnglishQuiz
//
//  Created by Komai Toshihiko on 2019/11/24.
//  Copyright © 2019 Komai Toshihiko. All rights reserved.
//

import UIKit

class QuizViewController: UIViewController {

    override func viewDidLoad() {
        super.viewDidLoad()
        
        if n == 10000 {
            list.shuffle()
        }
        n = list[doneCount]
        titleLabel.text = "第" + String(doneCount+1) + "問"
        quizView.text = quizList[n]
        
    }
    
    //ランダムキー収納変数
    var n = 10000
    
    //こなした問題カウント&第n問のn
    var doneCount = 0
    
    
    //第n問
    @IBOutlet weak var titleLabel: UILabel!
    
    //次へボタン
    @IBAction func goToNext(_ sender: Any) {
        doneCount += 1
        answerView.text = "Translate!!"
        if doneCount == quizList.count {
            doneCount = 0
            n = 10000
        }
        self.viewDidLoad()
    }
    
    //問題ビュー
    @IBOutlet weak var quizView: UILabel!
    
    //正解ビュー
    @IBOutlet weak var answerView: UILabel!
    
    //答えを表示
    @IBAction func showAnswer(_ sender: Any) {
        answerView.text = answerList[n]
    }
    
    
    
    //ランダムキー
    var list = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]
    
    let quizList = ["秋の田のかりほの庵の苫を荒み", "春すぎて夏来にけらし白たへの", "あしひきの山鳥の尾のしだり尾の", "田子の浦にうちいでて見れば白たへの", "奥山にもみぢ踏み分け鳴く鹿の", "かささぎの渡せる橋に置く霜の", "あまの原ふりさけ見ればかすがなる", "わが庵は都のたつみしかぞ住む", "花の色はうつりにけりないたづらに", "これやこの行くも帰るも別れては", "わたの原八十島かけて漕ぎいでぬと", "あまつ風雲のかよひ路吹きとぢよ", "つくばねの峰より落つるみなの川", "みちのくの忍ぶもぢずり誰ゆゑに", "君がため春の野にいでて若菜摘む", "立ち別れいなばの山の峰に生ふる", "ちはやふる神代も聞かず竜田川", "すみの江の岸による波よるさへや", "なにはがた短きあしのふしのまも", "わびぬれば今はた同じなにはなる", "今来むと言ひしばかりに長月の", "吹くからに秋の草木のしをるれば", "月見ればちぢにものこそ悲しけれ", "このたびはぬさも取りあへずたむけ山", "名にし負はば逢坂山のさねかづら", "小倉山峰のもみぢ葉心あらば", "みかの原わきて流るる泉川", "山里は冬ぞ寂しさまさりける", "心あてに折らばや折らむ初霜の", "有明のつれなく見えし別れより", "朝ぼらけ有明の月と見るまでに", "山川に風のかけたるしがらみは", "ひさかたの光のどけき春の日に", "たれをかも知る人にせむ高砂の", "人はいさ心も知らずふる里は", "夏の夜はまだ宵ながら明けぬるを", "白露に風の吹きしく秋の野は", "忘らるる身をば思はずちかひてし", "浅茅生の小野のしの原忍ぶれど", "忍ぶれど色にいでにけりわが恋は", "恋すてふわが名はまだき立ちにけり", "ちぎりきなかたみに袖をしぼりつつ", "あひ見ての後の心にくらぶれば", "あふことの絶えてしなくばなかなかに", "あはれとも言ふべき人は思ほえで", "ゆらのとを渡る舟人かぢを絶え", "八重むぐら茂れるやどの寂しきに", "風をいたみ岩打つ波のおのれのみ", "み垣もり衛士のたく火の夜はもえ", "君がため惜しからざりし命さへ", "かくとだにえやはいぶきのさしも草", "明けぬれば暮るるものとは知りながら", "歎きつつひとりぬる夜の明くるまは", "忘れじの行く末まではかたければ", "滝の音は絶えて久しくなりぬれど", "あらざらむこの世のほかの思ひ出に", "めぐりあひて見しやそれともわかぬまに", "ありま山ゐなの笹原風吹けば", "やすらはで寝なましものをさ夜ふけて", "大江山いく野の道の遠ければ", "いにしへの奈良の都の八重桜", "夜をこめてとりのそらねははかるとも", "今はただ思ひ絶えなむとばかりを", "朝ぼらけ宇治の川霧絶え絶えに", "恨みわびほさぬ袖だにあるものを", "もろともにあはれと思へ山桜", "春の夜の夢ばかりなる手枕に", "心にもあらでうき世にながらへば", "嵐吹くみむろの山のもみぢ葉は", "寂しさにやどを立ちいでてながむれば", "夕されば門田の稲葉おとづれて", "音に聞くたかしの浜のあだ波は", "高砂のをのへの桜咲きにけり", "うかりける人を初瀬の山おろし", "ちぎりおきしさせもが露を命にて", "わたの原漕ぎいでて見ればひさかたの", "瀬を旱み岩にせかるる滝川の", "淡路島かよふ千鳥の鳴く声に", "秋風にたなびく雲の絶え間より", "長からむ心も知らず黒髪の", "ほととぎす鳴きつるかたをながむれば", "思ひわびさても命はあるものを", "世の中よ道こそなけれ思ひ入る", "長らへばまたこの頃やしのばれむ", "夜もすがらもの思ふ頃は明けやらで", "歎けとて月やはものを思はする", "むらさめの露もまだひぬまきの葉に", "なには江のあしのかり寝のひとよゆゑ", "玉の緒よ絶えなば絶えね長らへば", "見せばやな雄島のあまの袖だにも", "きりぎりす鳴くや霜夜のさむしろに", "わが袖は潮ひに見えぬ沖の石の", "世の中は常にもがもななぎさ漕ぐ", "み吉野の山の秋風さ夜ふけて", "おほけなくうき世の民におほふかな", "花さそふ嵐の庭の雪ならで", "来ぬ人をまつほの浦の夕なぎに", "風そよぐならの小川の夕暮は", "人も惜し人も恨めしあぢきなく", "ももしきや古き軒ばの忍ぶにも"]
    
    
    let answerList = ["わがころも手は露に濡れつつ", "ころもほすてふあまの香具山", "ながながし夜をひとりかも寝む", "富士の高嶺に雪は降りつつ", "声聞く時ぞ秋は悲しき", "白きを見れば夜ぞふけにける", "み笠の山にいでし月かも", "世を宇治山と人は言ふなり", "わが身世にふるながめせしまに", "知るも知らぬも逢坂の関", "人には告げよあまの釣舟", "をとめの姿しばしとどめむ", "恋ぞ積りて淵となりぬる", "乱れそめにしわれならなくに", "わがころも手に雪は降りつつ", "まつとし聞かばいざ帰り来む", "からくれなゐに水くくるとは", "夢のかよひ路人目よくらむ", "あはでこの世をすごしてよとや", "みをつくしてもあはむとぞ思ふ", "有明の月を待ちいでつるかな", "むべ山風を嵐と言ふらむ", "わが身ひとつの秋にはあらねど", "もみぢのにしき神のまにまに", "人に知られで来るよしもがな", "今ひとたびのみゆき待たなむ", "いつ見きとてか恋しかるらむ", "人目も草もかれぬと思へば", "置きまどはせる白菊の花", "暁ばかりうきものはなし", "吉野の里に降れる白雪", "流れもあへぬもみぢなりけり", "しづ心なく花の散るらむ", "松も昔の友ならなくに", "花ぞ昔の香に匂ひける", "雲のいづこに月宿るらむ", "つらぬきとめぬ玉ぞ散りける", "人の命の惜しくもあるかな", "あまりてなどか人の恋しき", "ものや恩ふと人の問ふまで", "人知れずこそ思ひそめしか", "末の松山波越さじとは", "昔はものを思はざりけり", "人をも身をも恨みざらまし", "身のいたづらになりぬべきかな", "行くへも知らぬ恋の道かな", "人こそ見えね秋は来にけり", "くだけてものを思ふ頃かな", "昼は消えつつものをこそ思へ", "長くもがなと思ひけるかな", "さしも知らじなもゆる思ひを", "なほ恨めしき朝ぼらけかな", "いかに久しきものとかは知る", "今日を限りの命ともがな", "名こそ流れてなほ聞こえけれ", "今ひとたぴのあふこともがな", "雲隠れにし夜はの月かな", "いでそよ人を忘れやはする", "かたぶくまでの月を見しかな", "まだふみも見ずあまの橋立", "今日九重ににほひぬるかな", "よに逢坂の関は許さじ", "人づてならで言ふよしもがな", "あらはれわたる瀬々の網代木", "恋にくちなむ名こそ惜しけれ", "花よりほかに知る人もなし", "かひなく立たむ名こそ惜しけれ", "恋しかるべき夜はの月かな", "竜田の川のにしきなりけり", "いづくも同じ秋の夕暮", "あしのまろ屋に秋風ぞ吹く", "かけじや袖の濡れもこそすれ", "と山のかすみ立たずもあらなむ", "激しかれとは祈らぬものを", "あはれ今年の秋もいぬめり", "雲居にまがふ沖つ白波", "われても末にあはむとぞ思ふ", "いく夜寝覚めぬ須磨の関もり", "もれいづる月の影のさやけさ", "乱れて今朝はものをこそ思へ", "ただ有明の月ぞ残れる", "うきにたへぬは涙なりけり", "山の奥にも鹿ぞ鳴くなる", "うしと見し世ぞ今は恋しき", "ねやのひまさへつれなかりけり", "かこち顔なるわか涙かな", "霧たちのぼる秋の夕暮", "身をつくしてや恋ひわたるべき", "忍ぶることの弱りもぞする", "濡れにぞ濡れし色は変らず", "ころもかた敷きひとりかも寝む", "人こそ知らね乾くまもなし", "あまのを舟の綱手かなしも", "ふるさと寒くころも打つなり", "わが立つそまに墨染の袖", "ふりゆくものはわが身なりけり", "やくやもしほの身もこがれつつ", "みそぎぞ夏のしるしなりける", "世を思ふゆゑにもの思ふ身は", "なほあまりある昔なりけり"]

    
    
}


/*
quel=[]
def change():
    for i in range(0,len(questions)):
        quel.append("\""+questions[i]["question"]+"\",")

ansl=[]
def change2():
    for i in range(0,len(questions)):
        ansl.append("\""+questions[i]["answer"]+"\",")

def output():
    for i in range(0,len(questions)):
        print(quel[i])

def output2():
    for i in range(0,len(questions)):
        print(ansl[i])
 */
